# {Python 코드 작성 시 유의 사항}
# 1. 들여쓰기를 반드시 사용해여 한다.(tab)
# 2. 대, 소문자 구분을 해야 한다.

# [출력함수 사용하기]
# - print 함수 (코드상의 어떠한 내용을 출력할 때 사용한다.)
# - 어떠한 내용을 출력하기 위해 ""(쌍따옴표), ''(홑따옴표)를 이용한다.
# - 출력 내용이 길어질 경우 ;(세미콜론)을 이용하여 같은 라인에서 코드를 작성 ex)print("------------");print('========')
# - print함수와 연산처리를 동시에 진행 할 수 있다.


# 한줄주석
'''
구
문
주
석
'''

'''
# [예제 1]
print("어서와 Python은 처음이지")
print("Python Code Test!")
print("내용"); print("출력")


# [문제 1]
# 본인의 인적 사항을 아래와 같이 출력 시키시오.
# 저의 이름은 ㅇㅇㅇ 입니다.
# 저의 나이는 ㅇㅇ살 입니다.
# 주소는 ㅇㅇㅇㅇ입니다.

print("저의 이름은 진우현 입니다.")
print("저의 나이는 26살 입니다.")
print("주소는 산본시 입니다.")

# [예제 2]
print("10더하기20")
print("10더하기20 =", 10+20)
print("10곱하기20")
print("10곱하기20 =", 10*20)

# [문제 2] 아래와 같이 출력 시키시오.
# ( 결과 값은 자동연산 되도록 하세요.)
# 12 + 54 = 66 입니다.
# 268 - 42 = 226 입니다.
# 2 * 23 = 46 입니다.
# 120 / 3 = 40.0 입니다.
'''
print("12 + 54 =", 12+54, "입니다.")
print("268 - 42 =", 268-42, "입니다.")
print("2 * 23 =", 2*23, "입니다.")
print("120 / 3 =", 120/3, "입니다.")